using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class StageObject : MonoBehaviour
{
    public enum ENUM_ObjTypes
    {
        固定,
        壁,
        敵,
        ベルトコンベア,
        スイッチとドア,
        扇風機,
        露出配線,
        分割壁,
        ムービーイベント判定
    }

    public enum ENUM_MovieIvent
    {
        クリアムービー = 1,
        ドリルムービー = 3,
        ラスボスムービー = 4,
    }

    // オブジェクトの番号
    public int objectNumber;

    // オブジェクトのタイプ
    public ENUM_ObjTypes objectType;

    //-固定のパラメータ----------------------------------------
    public int VersionDeff;
    //---------------------------------------------------------

    //-壁のパラメータ------------------------------------------
    public int InvisibleNum;
    //---------------------------------------------------------

    //-ベルトコンベアのパラメータ------------------------------
    public float ConveyerSpeed;
    //---------------------------------------------------------

    //-ベルトコンベアのパラメータ------------------------------
    //-スイッチとドアのパラメータ------------------------------
    //-扇風機のパラメータ--------------------------------------
    //-露出配線のパラメータ------------------------------------
    public int ConnectNum;

    //-スイッチとドアのパラメータ------------------------------
    public bool Return;
    //---------------------------------------------------------

    //-扇風機のパラメータ--------------------------------------
    public float FanPower;
    public float WindDistance;
    //---------------------------------------------------------

    //-分割壁のパラメータ--------------------------------------
    public bool IsCollapse;
    //---------------------------------------------------------
    //-ムービーイベント判定のパラメータ------------------------
    public ENUM_MovieIvent MovieIvent;
    //---------------------------------------------------------
}